# Используем официальный образ Node.js в качестве основного образа
FROM node:14

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем package.json и package-lock.json (если используется) в текущую директорию внутри контейнера
COPY package.json /app/

# Устанавливаем зависимости
RUN npm install

# Копируем остальные файлы проекта в текущую директорию внутри контейнера
COPY ./ /app/

# Собираем приложение
RUN npm run build

ENV HOST 0.0.0.0
ENV NODE_ENV production

# Открываем порт 3000
EXPOSE 3000

# Запускаем приложение при запуске контейнера
CMD [ "npm", "start" ]